[
    {
        "icon": "cloud",
        "title": "Climate of Hong Kong",
        "subtitle": "What clothes to pack?",
        "content": "Hong Kong has a subtropical climate. The only predictable weather events that could have a significant impact on your travel plans are typhoons. Typhoon season begins in May and ends in November. When a typhoon is approaching, warnings are broadcast on television and radio. There are various degrees of warning signals issued by the Hong Kong Observatory, but when the No. 8 signal is in place, most businesses and shops close down and flights may be cancelled. There is a separate warning system for heavy rain. You can find detailed weather updates for tourist attractions on the Hong Kong Weather Information for Tourists website. While you’re in Hong Kong, you can also dial 1878 200 and press '3' for English to check the latest situation."
    },
    {
        "icon": "home",
        "title": "Tong Lau",
        "subtitle": "Hong Kong's historic building style",
        "content": "The history of the city’s vernacular architecture can be told through two defining styles of building, each dating from either side of World War II: the colonial-influenced tong lau from before and the high-rise composite buildings from after – each of them forms of tenement dwelling. These buildings form the heart of Hong Kong. Even as mega malls and tower blocks gain on the streets and skyline, the city, at its core, is an amalgamation of these gritty, weathered blocks – a tangle of pastel-coloured low-rises."
    },
    {
        "icon": "attach_money",
        "title": "Currency & e-payment",
        "subtitle": "Where to exchange currency?",
        "content": "The legal tender in Hong Kong is the Hong Kong dollar (HKD), which is pegged to the US dollar at a rate of about 7.80 HKD to 1 USD, although exchange rates may fluctuate slightly. You can exchange your currency for Hong Kong dollars at any authorised money exchanger. For extra peace of mind, look for a money exchanger that is accredited by the Quality Tourism Services (QTS) Scheme. At Hong Kong International Airport, currency exchange counters are open from early morning until late at night and many located within the city stay open into the evening. ATMs are widespread and operate 24 hours. Exchange rates fluctuate daily depending on currency markets."
    }
]